; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	infrared1 - mode
	spectrograph2 - mode
	image0 - mode
	GroundStation0 - direction
	GroundStation1 - direction
	GroundStation2 - direction
	GroundStation4 - direction
	GroundStation7 - direction
	GroundStation6 - direction
	Star3 - direction
	GroundStation5 - direction
	GroundStation8 - direction
	Star9 - direction
	Planet10 - direction
	Planet11 - direction
	Star12 - direction
	Phenomenon13 - direction
	Star14 - direction
	Star15 - direction
	Planet16 - direction
)
(:init
	(supports instrument0 infrared1)
	(calibration_target instrument0 Star9)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet10)
	(supports instrument1 spectrograph2)
	(calibration_target instrument1 Star3)
	(calibration_target instrument1 Star9)
	(calibration_target instrument1 GroundStation5)
	(supports instrument2 spectrograph2)
	(supports instrument2 image0)
	(supports instrument2 infrared1)
	(calibration_target instrument2 Star3)
	(calibration_target instrument2 GroundStation6)
	(calibration_target instrument2 Star9)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet10)
	(supports instrument3 image0)
	(supports instrument3 spectrograph2)
	(calibration_target instrument3 GroundStation5)
	(supports instrument4 image0)
	(calibration_target instrument4 GroundStation8)
	(calibration_target instrument4 GroundStation5)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet11)
	(supports instrument5 image0)
	(calibration_target instrument5 Star9)
	(on_board instrument5 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star12)
)
(:goal (and
	(pointing satellite0 Star14)
	(pointing satellite1 GroundStation4)
	(pointing satellite2 GroundStation2)
	(pointing satellite3 Star15)
	(have_image Planet10 image0)
	(have_image Planet11 infrared1)
	(have_image Star12 image0)
	(have_image Star14 spectrograph2)
	(have_image Star15 infrared1)
	(have_image Planet16 spectrograph2)
))

)

; plan
1. (turn_to satellite3 star15 star12)
   deleted: (pointing satellite3 star12)
   added: (pointing satellite3 star15)
   goals met: 1 of 10
2. (turn_to satellite2 groundstation2 planet11)
   deleted: (pointing satellite2 planet11)
   added: (pointing satellite2 groundstation2)
   goals met: 2 of 10
3. (turn_to satellite1 groundstation6 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 groundstation6)
   goals met: 2 of 10
4. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 2 of 10
5. (calibrate satellite1 instrument2 groundstation6)
   added: (calibrated instrument2)
   goals met: 2 of 10
6. (turn_to satellite1 planet11 groundstation6)
   deleted: (pointing satellite1 groundstation6)
   added: (pointing satellite1 planet11)
   goals met: 2 of 10
7. (take_image satellite1 planet11 instrument2 infrared1)
   added: (have_image planet11 infrared1)
   goals met: 3 of 10
8. (turn_to satellite1 planet10 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 planet10)
   goals met: 3 of 10
9. (turn_to satellite0 star14 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 star14)
   goals met: 4 of 10
10. (take_image satellite1 planet10 instrument2 image0)
   added: (have_image planet10 image0)
   goals met: 5 of 10
11. (turn_to satellite1 planet16 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 planet16)
   goals met: 5 of 10
12. (take_image satellite1 planet16 instrument2 spectrograph2)
   added: (have_image planet16 spectrograph2)
   goals met: 6 of 10
13. (turn_to satellite1 star12 planet16)
   deleted: (pointing satellite1 planet16)
   added: (pointing satellite1 star12)
   goals met: 6 of 10
14. (take_image satellite1 star12 instrument2 image0)
   added: (have_image star12 image0)
   goals met: 7 of 10
15. (turn_to satellite1 star14 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 star14)
   goals met: 7 of 10
16. (take_image satellite1 star14 instrument2 spectrograph2)
   added: (have_image star14 spectrograph2)
   goals met: 8 of 10
17. (turn_to satellite1 star15 star14)
   deleted: (pointing satellite1 star14)
   added: (pointing satellite1 star15)
   goals met: 8 of 10
18. (take_image satellite1 star15 instrument2 infrared1)
   added: (have_image star15 infrared1)
   goals met: 9 of 10
19. (turn_to satellite1 groundstation4 star15)
   deleted: (pointing satellite1 star15)
   added: (pointing satellite1 groundstation4)
   goals met: 10 of 10
